Белгипрозем_2017/src/Documents/мСписаниеЗадолженности/мСписаниеЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мСписаниеЗадолженности</name>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <attributes>
    <name>ВидСписанияЗадолженности</name>
    <type>
      <types>EnumRef.мВидыСписанияЗадолженности</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.мКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Акты</name>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозникновения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Enums/мВидыСписанияЗадолженности/мВидыСписанияЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мВидыСписанияЗадолженности</name>
  <enumValues>
    <name>НаУбытки</name>
  </enumValues>
  <enumValues>
    <name>НаДоходы</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Documents/мСписаниеЗадолженности/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", НачалоДня(ДокументСсылка.Дата));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА мСписаниеЗадолженностиАкты.Ссылка.ВидСписанияЗадолженности = ЗНАЧЕНИЕ(Перечисление.мВидыСписанияЗадолженности.НаУбытки)
	               |			ТОГДА -мСписаниеЗадолженностиАкты.Сумма
	               |		ИНАЧЕ мСписаниеЗадолженностиАкты.Сумма
	               |	КОНЕЦ КАК Сумма,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	мСписаниеЗадолженностиАкты.Договор КАК Договор,
	               |	мСписаниеЗадолженностиАкты.ЭтапДоговора КАК ЭтапДоговора,
	               |	мСписаниеЗадолженностиАкты.Корреспондент КАК Корреспондент,
	               |	мСписаниеЗадолженностиАкты.Ссылка.ВидСписанияЗадолженности КАК ВидСписанияЗадолженности,
	               |	мСписаниеЗадолженностиАкты.Ссылка.Дата КАК Период
	               |ИЗ
	               |	Документ.мСписаниеЗадолженности.Акты КАК мСписаниеЗадолженностиАкты
	               |ГДЕ
	               |	мСписаниеЗадолженностиАкты.Ссылка = &Ссылка";
	
	Результат          = Запрос.Выполнить().Выгрузить();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", Результат);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()
